import random
import re
import telebot
import config

bot = telebot.TeleBot(config.TOKEN)

def translate_russian_to_ukrainian(word):
    translation_dict = {
# А
    
# Б
        'бистро': 'швидко',
        'больше': 'більше',
        'боюсь': 'боюся',
        'бес': 'біс',
        'бесит': 'бісить',
        
# В
        'вопрос': 'питання/запитання',
# Г
        'где': 'де',
        'говоришь': 'говориш/кажеш/розмовляєш/спілкуєшся',

# Ґ

# Д
        'да': 'так/та',
        'даров': 'здоров',
        'даровка': 'здоров',

# Е
        'ему': 'йому',
        'её': 'її',
        'если': 'якщо',
        'ещё': 'ще',

# Є

# Ж
        'жёстко': 'жорстоко',

# З
        'значит': 'значить/це означає',

# И
        'иди': 'йди/іди',

# І

# Ї

# Й

# К
        'как': 'як',
        'канеш': 'звісно',
        'канешно': 'звісно',
        'когда': 'коли',
        'красивый': 'красивий',

# Л
        'ладно': 'гаразд/окей',
        
# М
        'мать': 'мати',
        'меня': 'мене',
        'мы': 'ми',
        'мой': 'мій',
        'мне': 'мені',
        'молчи': 'мовчи',
        
        
# Н
#         'не': 'ні', ВИКЛЮЧЕННЯ
        'надо': 'потрібно'
        'немного': 'трохи/трішки',
        'немножко': 'трішки/трошки',
        'нет': 'ні/немає',
        'ничего': 'нічого',
        'но': 'але',
        
# О
        'от': 'від/з/ось',
        
# П
        'понятно': 'зрозуміло',
        'похож': 'похожий/схожий/подібний',
        'почему': 'чому',
        'почти': 'майже',
        'писать': 'писати',
        'привык': 'привик/звик',
        

# Р
        'ребят': 'друзі',

# С
        'свой': 'свій',
        'сейчас': 'зараз / на даний момент',
        'сложный': 'важкий',
        'спасиба': 'Дякую',
        'спасибо': 'дякую',
        

# Т
        'такое': 'таке',
#         'тебе': 'тобі', ВИКЛЮЧЕННЯ
        'ты': 'ти',
        'тебя': 'тебе',
        'только': 'тільки/лише',
        'тяжело': 'важко/тяжко',

# У
        'уже': 'вже',

# Ф
        'франсузком': 'французькій',

# Х
        'хотел': 'здоров',

# Ц

# Ч
        'час': 'година',
        'часов': 'годин',
        'чево': 'чого',
        'чего': 'чого',
        'чиво': 'чого',
        'чо': 'що/чого',
        'что': 'що',

# Ш
        'шо': 'що',
        'што': 'що',

# Щ

# Ь

# Ю

# Я
        
        
        
        

#         'мы': 'ми',
#         'ничего': 'нічого',
#         'от': 'від/з',
#         'сложный': 'важкий',
#         'вопрос': 'питання/запитання',
#         'ещё': 'ще',
    }
    return translation_dict.get(word, word)

@bot.message_handler(func=lambda message: True)
def handle_message(bot, message):
    text = message.text.lower()
    words = re.findall(r'\b\w+\b', text)  # Знаходимо окремі слова в тексті

    translated_words = []
    for word in words:
        ukrainian_word = translate_russian_to_ukrainian(word)
        if word != ukrainian_word:
            translated_words.append((word, ukrainian_word))

    if translated_words:
        reply = ""
        for word_pair in translated_words:
            reply += f"{word_pair[0]}, "
        reply += "немає в українській мові, правильно "
        for word_pair in translated_words:
            reply += f"{word_pair[1]} "
        bot.reply_to(message, reply)
